b = 'Вулверхэмптон НЮ 1-1 МС Челси 6-0 Тоттенхэм Лестер 3-1 Брайтон Бёрнли 1-3 Кристал Вест 1-1 Ливерпуль Борнмут 3-0 Саутгемптон Кардифф 1-2 Уотфорд Эвертон 1-0 Хаддерсфилд Арсенал 1-2 Фулхэм МЮ 0-3 Эвертон МС 0-2 Вест Ливерпуль 1-1 МС Арсенал 3-1 Лестер МЮ 0-1 Кардифф Борнмут 2-0 Бёрнли Саутгемптон 1-1 Брайтон Уотфорд 0-0 Кристал Фулхэм 2-0 Челси Хаддерсфилд 5-0 Эвертон Вулверхэмптон 1-3 Тоттенхэм НЮ 1-0 Ливерпуль Лестер 1-1 Тоттенхэм Уотфорд 2-1 Борнмут Челси 4-0 Саутгемптон Кристал 1-1 МЮ Бёрнли 2-2 НЮ МС 2-1 Арсенал Кардифф 2-1 Вулверхэмптон Вест 3-0 Фулхэм Брайтон 4-2 Хаддерсфилд Эвертон 0-1 Фулхэм Тоттенхэм 1-2 Хаддерсфилд МС 0-3 Арсенал Челси 2-0 Борнмут Вест 2-0 Ливерпуль Кристал 4-3 МЮ Брайтон 2-1 НЮ Кардифф 3-0 Саутгемптон Эвертон 2-1 Уотфорд Бёрнли 0-0 Вулверхэмптон Лестер 4-3 МС Вулверхэмптон 3-0 Тоттенхэм МЮ 0-1 Эвертон Борнмут 2-0 Челси НЮ 2-1 Бёрнли Фулхэм 2-1 Брайтон Ливерпуль 0-1 Кардифф Хаддерсфилд 0-0 Кристал Уотфорд 1-2 Лестер Саутгемптон 1-2 Вест Арсенал 1-0 МС Ливерпуль 2-1 НЮ МЮ 0-2 Борнмут Уотфорд 3-3 Вест Брайтон 2-2 Вулверхэмптон Кристал 0-2 Хаддерсфилд Бёрнли 1-2 Челси Саутгемптон 0-0 Кардифф Тоттенхэм 0-3 Арсенал Фулхэм 4-1 МЮ Борнмут 4-1 Бёрнли Вест 2-0 Саутгемптон МС 1-3 Кристал Челси 0-1 Ливерпуль Арсенал 5-1 Брайтон Эвертон 1-0 Лестер Кардифф 0-1 Тоттенхэм Вулверхэмптон 1-3 Уотфорд НЮ 1-1 Фулхэм Хаддерсфилд 1-0 Саутгемптон Вест 1-2 Уотфорд Челси 1-2 Брайтон Арсенал 1-1 Бёрнли Эвертон 1-5 Кристал Кардифф 0-0 Лестер МС 2-1 Ливерпуль НЮ 4-0 МЮ Хаддерсфилд 3-1 Тоттенхэм Борнмут 5-0 Фулхэм Вулверхэмптон 1-1 Эвертон Тоттенхэм 2-6 Кардифф МЮ 1-5 Борнмут Брайтон 2-0 Вест Уотфорд 0-2 МС Кристал 2-3 НЮ Фулхэм 0-0 Хаддерсфилд Саутгемптон 1-3 Челси Лестер 0-1 Арсенал Бёрнли 3-1 Вулверхэмптон Ливерпуль 0-2 Ливерпуль МЮ 3-1 Брайтон Челси 1-2 Саутгемптон Арсенал 3-2 Фулхэм Вест 0-2 Вулверхэмптон Борнмут 2-0 Кристал Лестер 1-0 Тоттенхэм Бёрнли 1-0 Уотфорд Кардифф 3-2 Хаддерсфилд НЮ 0-1 МС Эвертон 3-1 Эвертон Уотфорд 2-2 НЮ Вулверхэмптон 1-2 Лестер Тоттенхэм 0-2 Челси МС 2-0 Арсенал Хаддерсфилд 1-0 Бёрнли Брайтон 1-0 Вест Кристал 3-2 Кардифф Саутгемптон 1-0 МЮ Фулхэм 4-1 Борнмут Ливерпуль 0-4 МЮ Арсенал 2-2 Тоттенхэм Саутгемптон 3-1 Бёрнли Ливерпуль 1-3 Вулверхэмптон Челси 2-1 Фулхэм Лестер 1-1 Эвертон НЮ 1-1 Уотфорд МС 1-2 Борнмут Хаддерсфилд 2-1 Брайтон Кристал 3-1 Вест Кардифф 3-1 Ливерпуль Эвертон 1-0 Арсенал Тоттенхэм 4-2 Челси Фулхэм 2-0 Саутгемптон МЮ 2-2 Кристал Бёрнли 2-0 Лестер Уотфорд 2-0 МС Борнмут 3-1 НЮ Вест 0-3 Хаддерсфилд Брайтон 1-2 Кардифф Вулверхэмптон 2-1 Бёрнли НЮ 1-2 Вулверхэмптон Хаддерсфилд 0-2 Борнмут Арсенал 1-2 Тоттенхэм Челси 3-1 Брайтон Лестер 1-1 Вест МС 0-4 МЮ Кристал 0-0 Уотфорд Ливерпуль 0-3 Фулхэм Саутгемптон 3-2 Эвертон Кардифф 1-0 Арсенал Вулверхэмптон 1-1 МС МЮ 3-1 Челси Эвертон 0-0 Ливерпуль Фулхэм 2-0 Кристал Тоттенхэм 0-1 Лестер Бёрнли 0-0 НЮ Борнмут 2-1 Саутгемптон Уотфорд 1-1 Хаддерсфилд Вест 1-1 Кардифф Брайтон 2-1 Хаддерсфилд Фулхэм 1-0 Челси Кристал 3-1 МС Саутгемптон 6-1 Вулверхэмптон Тоттенхэм 2-3 Арсенал Ливерпуль 1-1 Вест Бёрнли 4-2 Кардифф Лестер 0-1 НЮ Уотфорд 1-0 Эвертон Брайтон 3-1 Борнмут МЮ 1-2 Тоттенхэм МС 0-1 МЮ Эвертон 2-1 Бёрнли Челси 0-4 Кристал Арсенал 2-2 Лестер Вест 1-1 Брайтон Вулверхэмптон 1-0 Ливерпуль Кардифф 4-1 Саутгемптон НЮ 0-0 Уотфорд Хаддерсфилд 3-0 Фулхэм Борнмут 0-3 Арсенал Лестер 3-1 Эвертон Кристал 2-0 Хаддерсфилд Ливерпуль 0-1 Борнмут Саутгемптон 0-0 Вест Тоттенхэм 0-1 Вулверхэмптон Уотфорд 0-2 Кардифф Фулхэм 4-2 МС Бёрнли 5-0 НЮ Брайтон 0-1 Челси МЮ 2-2 Ливерпуль МС 0-0 Саутгемптон Челси 0-3 Фулхэм Арсенал 1-5 МЮ НЮ 3-2 Бёрнли Хаддерсфилд 1-1 Кристал Вулверхэмптон 0-1 Лестер Эвертон 1-2 Тоттенхэм Кардифф 1-0 Уотфорд Борнмут 0-4 Брайтон Вест 1-0 Борнмут Кристал 2-1 Кардифф Бёрнли 1-2 Челси Ливерпуль 1-1 Арсенал Уотфорд 2-0 Вулверхэмптон Саутгемптон 2-0 МС Брайтон 2-0 НЮ Лестер 0-2 Хаддерсфилд Тоттенхэм 0-2 Эвертон Фулхэм 3-0 Вест МЮ 3-1 Арсенал Эвертон 2-0 Вест Челси 0-0 Брайтон Тоттенхэм 1-2 Бёрнли Борнмут 4-0 Кардифф МС 0-5 Кристал НЮ 0-0 Лестер Хаддерсфилд 3-1 Ливерпуль Саутгемптон 3-0 МЮ Вулверхэмптон 1-1 Фулхэм Уотфорд 1-1 Саутгемптон Брайтон 2-2 Эвертон Вест 1-3 Вулверхэмптон Бёрнли 1-0 Уотфорд МЮ 1-2 Борнмут Лестер 4-2 МС Фулхэм 3-0 НЮ Арсенал 1-2 Хаддерсфилд Кристал 0-1 Челси Кардифф 4-1 Тоттенхэм Ливерпуль 1-2 Бёрнли МЮ 0-2 Уотфорд Тоттенхэм 2-1 Кардифф Арсенал 2-3 МС НЮ 2-1 Брайтон Фулхэм 2-2 Вест Вулверхэмптон 0-1 Кристал Саутгемптон 0-2 Челси Борнмут 2-0 Эвертон Хаддерсфилд 1-1 Лестер Ливерпуль 1-2 МЮ Тоттенхэм 0-3 НЮ Челси 1-2 Фулхэм Бёрнли 4-2 Уотфорд Кристал 2-1 Ливерпуль Брайтон 1-0 Арсенал Вест 3-1 Борнмут Эвертон 2-2 Саутгемптон Лестер 1-2 Хаддерсфилд Кардифф 0-0 Вулверхэмптон МС 1-1 Кристал Ливерпуль 0-2 Брайтон МЮ 3-2 Бёрнли Уотфорд 1-3 МС Хаддерсфилд 6-1 Челси Арсенал 3-2 Вест Борнмут 1-2 Лестер Вулверхэмптон 2-0 Тоттенхэм Фулхэм 3-1 Эвертон Саутгемптон 2-1 Кардифф НЮ 0-0 Арсенал МС 0-2 Ливерпуль Вест 4-0 Саутгемптон Бёрнли 0-0 Вулверхэмптон Эвертон 2-2 Борнмут Кардифф 2-0 Уотфорд Брайтон 2-0 Фулхэм Кристал 0-2 Хаддерсфилд Челси 0-3 НЮ Тоттенхэм 1-2 МЮ Лестер 2-1'


R = [[[], [], []], [[], [], []], [[], [], []], [[], [], []], [[], [], []], [[], [], []], [[], [], []], [[], [], []], [[], [], []]]


eng1 = ['Арсенал', 'Ливерпуль', 'МС', 'МЮ', 'Челси', 'Тоттенхэм']
eng2 = ['Борнмут', 'Брайтон', 'Вест', 'Вулверхэмптон', 'Кардифф', 'Кристал', 'Лестер', 'Уотфорд', 'Эвертон']
eng3 = ['Бёрнли', 'НЮ', 'Саутгемптон', 'Фулхэм', 'Хаддерсфилд']
eng = []
eng.append(eng1)
eng.append(eng2)
eng.append(eng3)


m = []
for n in b.split():
    m.append(n)



a = 0
for i in range(0, len(m)-1, 3):
    for r in range(len(eng3)-1):
        if m[i] == eng[2][r]:
            a = 1
    for r in range(len(eng2)-1):
        if m[i] == eng[1][r]:
            a = 2
    for r in range(len(eng1)-1):
        if m[i] == eng[0][r]:
            a = 3
    for r in range(len(eng3)-1):
        if m[i+1] == eng[2][r]:
            b = 1
    for r in range(len(eng2)-1):
        if m[i+1] == eng[1][r]:
            b = 2
    for r in range(len(eng1)-1):
        if m[i+1] == eng[0][r]:
            b = 3
    if a == 1 and b == 1:
        if m[i+2][0]>m[i+2][2]:
            R[0][0].append(1)
        if m[i+2][0]==m[i+2][2]:
            R[0][1].append(1)
        if m[i+2][0]<m[i+2][2]:
            R[0][2].append(1)
    if a == 1 and b == 2:
        if m[i+2][0]>m[i+2][2]:
            R[1][0].append(1)
        if m[i+2][0]==m[i+2][2]:
            R[1][1].append(1)
        if m[i+2][0]<m[i+2][2]:
            R[1][2].append(1)
    if a == 2 and b == 1:
        if m[i+2][0]>m[i+2][2]:
            R[2][0].append(1)
        if m[i+2][0]==m[i+2][2]:
            R[2][1].append(1)
        if m[i+2][0]<m[i+2][2]:
            R[2][2].append(1)
    if a == 2 and b == 2:
        if m[i+2][0]>m[i+2][2]:
            R[3][0].append(1)
        if m[i+2][0]==m[i+2][2]:
            R[3][1].append(1)
        if m[i+2][0]<m[i+2][2]:
            R[3][2].append(1)
    if a == 1 and b == 3:
        if m[i+2][0]>m[i+2][2]:
            R[4][0].append(1)
        if m[i+2][0]==m[i+2][2]:
            R[4][1].append(1)
        if m[i+2][0]<m[i+2][2]:
            R[4][2].append(1)
    if a == 3 and b == 1:
        if m[i+2][0]>m[i+2][2]:
            R[5][0].append(1)
        if m[i+2][0]==m[i+2][2]:
            R[5][1].append(1)
        if m[i+2][0]<m[i+2][2]:
            R[5][2].append(1)
    if a == 2 and b == 3:
        if m[i+2][0]>m[i+2][2]:
            R[6][0].append(1)
        if m[i+2][0]==m[i+2][2]:
            R[6][1].append(1)
        if m[i+2][0]<m[i+2][2]:
            R[6][2].append(1)
    if a == 3 and b == 2:
        if m[i+2][0]>m[i+2][2]:
            R[7][0].append(1)
        if m[i+2][0]==m[i+2][2]:
            R[7][1].append(1)
        if m[i+2][0]<m[i+2][2]:
            R[7][2].append(1)
    if a == 3 and b == 3:
        if m[i+2][0]>m[i+2][2]:
            R[8][0].append(1)
        if m[i+2][0]==m[i+2][2]:
            R[8][1].append(1)
        if m[i+2][0]<m[i+2][2]:
            R[8][2].append(1)
            
            
P = [[[], [], []], [[], [], []], [[], [], []], [[], [], []], [[], [], []], [[], [], []], [[], [], []], [[], [], []], [[], [], []]]


for i in range(len(R)):
    for e in range(len(R[i])):
        P[i][e].append(sum(R[i][e]))
print(P)
    
